---
kind: property
id: P:Autodesk.Revit.DB.Structure.EndTreatmentType.EndTreatment
source: html/26c093f3-e332-c4c6-d77f-69926a59bc7a.htm
---
# Autodesk.Revit.DB.Structure.EndTreatmentType.EndTreatment Property

String describing the end treatment

## Syntax (C#)
```csharp
public string EndTreatment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null